//
//  signal_process.c
//  STM_CoBrain
//
//  Created by 曾科 on 07/02/2018.
//  Copyright © 2018 Ke Zeng. All rights reserved.
//

#include"signal_process.h"


double filter_delta(double *x, double *y, int len, double raw_data)
{
    int i;
    double sum1, sum2;
    
    double b[9] = { 0.000005616572057, 0, -0.000022466288229, 0, 0.000033699432344, 0, -0.000022466288229, 0, 0.000005616572057 };
    double a[9] = { 1.000000000000000, -7.686049862967702, 25.898582022637310, -49.968972007268917, 60.380118509372025, -46.790453575039933, 22.708702078541506, -6.310799882022389, 0.768872743866651 };
    
    for (i = len - 2; i >= 0; --i)
    {
        x[i + 1] = x[i];
        y[i + 1] = y[i];
    }
    x[0] = raw_data;
    
    sum1 = b[0] * x[0];
    sum2 = 0;
    for (i = 1; i < len; ++i)
    {
        sum1 += b[i] * x[i];
        sum2 += a[i] * y[i];
    }
    y[0] = (sum1 - sum2) / a[0];
    
    return y[0];
}

double filter_theta(double *x, double *y, int len, double raw_data)
{
    int i;
    double sum1, sum2;
    
    double b[9] = { 0.000026734904009, 0, -0.000106939616035, 0, 0.000160409424052, 0, -0.000106939616035, 0, 0.000026734904009 };
    double a[9] = { 1.000000000000000, -7.283516493993766, 23.515823515854720, -43.939547973303135, 51.957304646197358, -39.811051277312401, 19.304712002786477, -5.417706614043770, 0.674024707627428 };
    
    for (i = len - 2; i >= 0; --i)
    {
        x[i + 1] = x[i];
        y[i + 1] = y[i];
    }
    x[0] = raw_data;
    
    sum1 = b[0] * x[0];
    sum2 = 0;
    for (i = 1; i < len; ++i)
    {
        sum1 += b[i] * x[i];
        sum2 += a[i] * y[i];
    }
    y[0] = (sum1 - sum2) / a[0];
    
    return y[0];
}

double filter_alpha(double *x, double *y, int len, double raw_data)
{
    int i;
    double sum1, sum2;
    
    double b[9] = { 0.000079570163458, 0, -0.000318280653831, 0, 0.000477420980747, 0, -0.000318280653831, 0, 0.000079570163458 };
    double a[9] = { 1.000000000000000, -6.490617919325293, 19.295757489547853, -34.130653905693457, 39.202434840307731, -29.919206166920915, 14.827846189334970, -4.372565294930116, 0.590703467459329 };
    
    for (i = len - 2; i >= 0; --i)
    {
        x[i + 1] = x[i];
        y[i + 1] = y[i];
    }
    x[0] = raw_data;
    
    sum1 = b[0] * x[0];
    sum2 = 0;
    for (i = 1; i < len; ++i)
    {
        sum1 += b[i] * x[i];
        sum2 += a[i] * y[i];
    }
    y[0] = (sum1 - sum2) / a[0];
    
    return y[0];
}



double filter_gamma(double *x, double *y, int len, double raw_data)
{
    int i;
    double sum1, sum2;
    
    double b[9] = { 0.002234891698082, 0, -0.008939566792329, 0, 0.013409350188494, 0, -0.008939566792329, 0, 0.002234891698082 };
    double a[9] = { 1.000000000000000, 1.294747105965478, 3.326811012025164, 2.811314591277211, 3.768097763315453, 2.023163933931305, 1.727769290912018, 0.476161868021022, 0.264454816443503 };
    
    for (i = len - 2; i >= 0; --i)
    {
        x[i + 1] = x[i];
        y[i + 1] = y[i];
    }
    x[0] = raw_data;
    
    sum1 = b[0] * x[0];
    sum2 = 0;
    for (i = 1; i < len; ++i)
    {
        sum1 += b[i] * x[i];
        sum2 += a[i] * y[i];
    }
    y[0] = (sum1 - sum2) / a[0];
    
    return y[0];
}


